# Machine Learning Foundation

## Section 1, Part a: Reading Data

### Learning Objective(s)

*   Create a SQL database connection to a sample SQL database, and read records from that database
*   Explore common input parameters

### Packages

*   [Pandas](https://pandas.pydata.org/pandas-docs/stable/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMML0232ENSkillsNetwork30654641-2022-01-01)
*   [Pandas.read_sql](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMML0232ENSkillsNetwork30654641-2022-01-01)
*   [SQLite3](https://docs.python.org/3.6/library/sqlite3.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMML0232ENSkillsNetwork30654641-2022-01-01)

## Simple data reads

Structured Query Language (SQL) is an [ANSI specification](https://docs.oracle.com/database/121/SQLRF/ap_standard_sql001.htm?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMML0232ENSkillsNetwork30654641-2022-01-01#SQLRF55514), implemented by various databases. SQL is a powerful format for interacting with large databases efficiently, and SQL allows for a consistent experience across a large market of databases. We'll be using sqlite, a lightweight and somewhat restricted version of sql for this example. sqlite uses a slightly modified version of SQL, which may be different than what you're used to.

In [1]:
# Imports
import sqlite3 as sq3
import pandas.io.sql as pds
import pandas as pd

### Database connections

Our first step will be to create a connection to our SQL database. A few common SQL databases used with Python include:

*   Microsoft SQL Server
*   Postgres
*   MySQL
*   AWS Redshift
*   AWS Aurora
*   Oracle DB
*   Terradata
*   Db2 Family
*   Many, many others

Each of these databases will require a slightly different setup, and may require credentials (username & password), tokens, or other access requirements. We'll be using `sqlite3` to connect to our database, but other connection packages include:

*   [`SQLAlchemy`](https://www.sqlalchemy.org/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMML0232ENSkillsNetwork30654641-2022-01-01) (most common)
*   [`psycopg2`](http://initd.org/psycopg/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMML0232ENSkillsNetwork30654641-2022-01-01)
*   [`MySQLdb`](http://mysql-python.sourceforge.net/MySQLdb.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMML0232ENSkillsNetwork30654641-2022-01-01)

In [5]:
# Download the database
!wget -P data https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-ML0232EN-SkillsNetwork/asset/classic_rock.db

--2023-04-11 09:43:37--  https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-ML0232EN-SkillsNetwork/asset/classic_rock.db
Resolving cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud (cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud)... 169.63.118.104
Connecting to cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud (cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud)|169.63.118.104|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 5652480 (5.4M) [binary/octet-stream]
Saving to: 'data/classic_rock.db'

     0K .......... .......... .......... .......... ..........  0% 20.8K 4m23s
    50K .......... .......... .......... .......... ..........  1% 21.0K 4m19s
   100K .......... .......... .......... .......... ..........  2% 18.8K 4m27s
   150K .......... .......... .......... .......... ..........  3% 22.2K 4m18s
   200K .......... .......... .......... .......... ..........  4% 20.2K 4m17s
   250K .......... .......... .......... .......... ..........  5% 24.7K 4m7s
   300K .......... .......... .......... .......... ..........  6% 29.8K 3m55s
   350K .......... .......... .......... .......... ..........  7% 33.4K 3m42s
   400K .......... .......... .......... .......... ..........  8% 22.2K 3m41s
   450K .......... .......... .......... .......... ..........  9% 40.5K 3m29s
   500K .......... .......... .......... .......... ..........  9% 40.8K 3m20s
   550K .......... .......... .......... .......... .......... 10% 34.9K 3m13s
   600K .......... .......... .......... .......... .......... 11% 69.1K 3m2s
   650K .......... .......... .......... .......... .......... 12% 47.7K 2m54s
   700K .......... .......... .......... .......... .......... 13% 41.6K 2m48s
   750K .......... .......... .......... .......... .......... 14% 60.9K 2m41s
   800K .......... .......... .......... .......... .......... 15% 30.6K 2m39s
   850K .......... .......... .......... .......... .......... 16% 75.1K 2m32s
   900K .......... .......... .......... .......... .......... 17% 75.9K 2m26s
   950K .......... .......... .......... .......... .......... 18% 60.4K 2m21s
  1000K .......... .......... .......... .......... .......... 19% 40.8K 2m18s
  1050K .......... .......... .......... .......... .......... 19% 60.9K 2m13s
  1100K .......... .......... .......... .......... .......... 20% 67.4K 2m9s
  1150K .......... .......... .......... .......... .......... 21% 45.4K 2m6s
  1200K .......... .......... .......... .......... .......... 22% 61.0K 2m2s
  1250K .......... .......... .......... .......... .......... 23% 40.7K 2m0s
  1300K .......... .......... .......... .......... .......... 24% 61.0K 1m57s
  1350K .......... .......... .......... .......... .......... 25% 40.8K 1m55s
  1400K .......... .......... .......... .......... .......... 26% 44.4K 1m53s
  1450K .......... .......... .......... .......... .......... 27% 60.6K 1m50s
  1500K .......... .......... .......... .......... .......... 28% 44.5K 1m48s
  1550K .......... .......... .......... .......... .......... 28% 60.9K 1m45s
  1600K .......... .......... .......... .......... .......... 29% 40.7K 1m44s
  1650K .......... .......... .......... .......... .......... 30% 47.4K 1m42s
  1700K .......... .......... .......... .......... .......... 31% 41.8K 1m40s
  1750K .......... .......... .......... .......... .......... 32% 48.8K 98s
  1800K .......... .......... .......... .......... .......... 33% 61.1K 96s
  1850K .......... .......... .......... .......... .......... 34% 44.5K 94s
  1900K .......... .......... .......... .......... .......... 35% 66.8K 92s
  1950K .......... .......... .......... .......... .......... 36% 75.0K 89s
  2000K .......... .......... .......... .......... .......... 37% 74.4K 87s
  2050K .......... .......... .......... .......... .......... 38%  151K 84s
  2100K .......... .......... .......... .......... .......... 38%  143K 82s
  2150K .......... .......... .......... .......... .......... 39% 48.9K 80s
  2200K .......... .......... .......... .......... .......... 40% 70.0K 78s
  2250K .......... .......... .......... .......... .......... 41%  149K 76s
  2300K .......... .......... .......... .......... .......... 42%  151K 74s
  2350K .......... .......... .......... .......... .......... 43%  148K 71s
  2400K .......... .......... .......... .......... .......... 44% 75.8K 70s
  2450K .......... .......... .......... .......... .......... 45%  150K 68s
  2500K .......... .......... .......... .......... .......... 46%  150K 66s
  2550K .......... .......... .......... .......... .......... 47%  149K 64s
  2600K .......... .......... .......... .......... .......... 48%  151K 62s
  2650K .......... .......... .......... .......... .......... 48%  148K 60s
  2700K .......... .......... .......... .......... .......... 49%  150K 58s
  2750K .......... .......... .......... .......... .......... 50%  150K 56s
  2800K .......... .......... .......... .......... .......... 51% 67.5K 55s
  2850K .......... .......... .......... .......... .......... 52% 47.9K 54s
  2900K .......... .......... .......... .......... .......... 53%  149K 52s
  2950K .......... .......... .......... .......... .......... 54%  150K 51s
  3000K .......... .......... .......... .......... .......... 55%  122K 49s
  3050K .......... .......... .......... .......... .......... 56% 74.9K 48s
  3100K .......... .......... .......... .......... .......... 57% 65.2K 47s
  3150K .......... .......... .......... .......... .......... 57% 61.2K 46s
  3200K .......... .......... .......... .......... .......... 58% 44.4K 45s
  3250K .......... .......... .......... .......... .......... 59% 69.7K 44s
  3300K .......... .......... .......... .......... .......... 60% 48.7K 43s
  3350K .......... .......... .......... .......... .......... 61%  123K 41s
  3400K .......... .......... .......... .......... .......... 62% 61.1K 40s
  3450K .......... .......... .......... .......... .......... 63% 44.5K 39s
  3500K .......... .......... .......... .......... .......... 64% 69.5K 38s
  3550K .......... .......... .......... .......... .......... 65% 43.4K 37s
  3600K .......... .......... .......... .......... .......... 66% 75.2K 36s
  3650K .......... .......... .......... .......... .......... 67% 73.1K 35s
  3700K .......... .......... .......... .......... .......... 67% 45.0K 34s
  3750K .......... .......... .......... .......... .......... 68% 63.1K 33s
  3800K .......... .......... .......... .......... .......... 69% 43.4K 32s
  3850K .......... .......... .......... .......... .......... 70% 45.6K 31s
  3900K .......... .......... .......... .......... .......... 71% 69.1K 30s
  3950K .......... .......... .......... .......... .......... 72% 46.8K 29s
  4000K .......... .......... .......... .......... .......... 73% 46.4K 28s
  4050K .......... .......... .......... .......... .......... 74% 40.7K 28s
  4100K .......... .......... .......... .......... .......... 75% 67.1K 27s
  4150K .......... .......... .......... .......... .......... 76% 72.5K 26s
  4200K .......... .......... .......... .......... .......... 76% 49.7K 25s
  4250K .......... .......... .......... .......... .......... 77% 40.1K 24s
  4300K .......... .......... .......... .......... .......... 78% 61.1K 23s
  4350K .......... .......... .......... .......... .......... 79% 44.4K 22s
  4400K .......... .......... .......... .......... .......... 80% 40.7K 21s
  4450K .......... .......... .......... .......... .......... 81% 74.6K 20s
  4500K .......... .......... .......... .......... .......... 82% 65.4K 19s
  4550K .......... .......... .......... .......... .......... 83% 67.7K 18s
  4600K .......... .......... .......... .......... .......... 84% 63.0K 17s
  4650K .......... .......... .......... .......... .......... 85% 60.8K 16s
  4700K .......... .......... .......... .......... .......... 86% 67.4K 15s
  4750K .......... .......... .......... .......... .......... 86% 47.6K 14s
  4800K .......... .......... .......... .......... .......... 87% 42.5K 13s
  4850K .......... .......... .......... .......... .......... 88% 61.0K 12s
  4900K .......... .......... .......... .......... .......... 89% 40.7K 11s
  4950K .......... .......... .......... .......... .......... 90% 61.1K 10s
  5000K .......... .......... .......... .......... .......... 91% 46.5K 9s
  5050K .......... .......... .......... .......... .......... 92% 75.2K 8s
  5100K .......... .......... .......... .......... .......... 93% 40.7K 7s
  5150K .......... .......... .......... .......... .......... 94% 69.7K 6s
  5200K .......... .......... .......... .......... .......... 95% 32.1K 5s
  5250K .......... .......... .......... .......... .......... 96% 62.8K 4s
  5300K .......... .......... .......... .......... .......... 96% 69.7K 3s
  5350K .......... .......... .......... .......... .......... 97% 40.7K 2s
  5400K .......... .......... .......... .......... .......... 98% 61.0K 1s
  5450K .......... .......... .......... .......... .......... 99% 60.9K 0s
  5500K .......... ..........                                 100% 53.1K=1m46s

2023-04-11 09:45:32 (52.0 KB/s) - 'data/classic_rock.db' saved [5652480/5652480]

In [6]:
# Initialize path to SQLite databasejdbc:sqlite:/C:/__tmp/test/sqlite/jdbcTest.db
path = 'data/classic_rock.db'
con = sq3.Connection(path)

# We now have a live connection to our SQL database

In [7]:
con

### Reading data

Now that we've got a connection to our database, we can perform queries, and load their results in as Pandas DataFrames

In [8]:
# Write the query
query = '''
SELECT * 
FROM rock_songs;
'''

# Execute the query
observations = pds.read_sql(query, con)

observations.head()

                     Song        Artist  Release_Year  PlayCount
0        Caught Up in You   .38 Special        1982.0         82
1         Hold On Loosely   .38 Special        1981.0         85
2  Rockin' Into the Night   .38 Special        1980.0         18
3       Art For Arts Sake          10cc        1975.0          1
4              Kryptonite  3 Doors Down        2000.0         13

In [9]:
# We can also run any supported SQL query
# Write the query
query = '''
SELECT Artist, Release_Year, COUNT(*) AS num_songs, AVG(PlayCount) AS avg_plays  
    FROM rock_songs
    GROUP BY Artist, Release_Year
    ORDER BY num_songs desc;
'''

# Execute the query
observations = pds.read_sql(query, con)

observations.head()

         Artist  Release_Year  num_songs  avg_plays
0   The Beatles        1967.0         23   6.565217
1  Led Zeppelin        1969.0         18  21.000000
2   The Beatles        1965.0         15   3.800000
3   The Beatles        1968.0         13  13.000000
4   The Beatles        1969.0         13  15.000000

## Common parameters

There are a number of common paramters that can be used to read in SQL data with formatting:

*   coerce_float: Attempt to force numbers into floats
*   parse_dates: List of columns to parse as dates
*   chunksize: Number of rows to include in each chunk

Let's have a look at using some of these parameters

In [10]:
query='''
SELECT Artist, Release_Year, COUNT(*) AS num_songs, AVG(PlayCount) AS avg_plays  
    FROM rock_songs
    GROUP BY Artist, Release_Year
    ORDER BY num_songs desc;
'''

# Execute the query
observations_generator = pds.read_sql(query,
                            con,
                            coerce_float=True, # Doesn't efefct this dataset, because floats were correctly parsed
                            parse_dates=['Release_Year'], # Parse `Release_Year` as a date
                            chunksize=5 # Allows for streaming results as a series of shorter tables
                           )

for index, observations in enumerate(observations_generator):
    if index < 5:
        print(f'Observations index: {index}'.format(index))
        display(observations)

Observations index: 0

         Artist        Release_Year  num_songs  avg_plays
0   The Beatles 1970-01-01 00:32:47         23   6.565217
1  Led Zeppelin 1970-01-01 00:32:49         18  21.000000
2   The Beatles 1970-01-01 00:32:45         15   3.800000
3   The Beatles 1970-01-01 00:32:48         13  13.000000
4   The Beatles 1970-01-01 00:32:49         13  15.000000

Observations index: 1

         Artist        Release_Year  num_songs  avg_plays
0  Led Zeppelin 1970-01-01 00:32:50         12  13.166667
1  Led Zeppelin 1970-01-01 00:32:55         12  14.166667
2    Pink Floyd 1970-01-01 00:32:59         11  41.454545
3    Pink Floyd 1970-01-01 00:32:53         10  29.100000
4     The Doors 1970-01-01 00:32:47         10  28.900000

Observations index: 2

          Artist        Release_Year  num_songs  avg_plays
0  Fleetwood Mac 1970-01-01 00:32:57          9  35.666667
1   Jimi Hendrix 1970-01-01 00:32:47          9  24.888889
2    The Beatles 1970-01-01 00:32:43          9   2.444444
3    The Beatles 1970-01-01 00:32:44          9   3.111111
4     Elton John 1970-01-01 00:32:53          8  18.500000

Observations index: 3

           Artist        Release_Year  num_songs  avg_plays
0    Led Zeppelin 1970-01-01 00:32:51          8  47.750000
1    Led Zeppelin 1970-01-01 00:32:53          8  34.125000
2          Boston 1970-01-01 00:32:56          7  69.285714
3  Rolling Stones 1970-01-01 00:32:49          7  36.142857
4       Van Halen 1970-01-01 00:32:58          7  51.142857

Observations index: 4

                         Artist        Release_Year  num_songs  avg_plays
0             Bruce Springsteen 1970-01-01 00:32:55          6   7.666667
1             Bruce Springsteen 1970-01-01 00:33:04          6  11.500000
2  Creedence Clearwater Revival 1970-01-01 00:32:49          6  23.833333
3  Creedence Clearwater Revival 1970-01-01 00:32:50          6  18.833333
4                   Def Leppard 1970-01-01 00:33:07          6  32.000000

### Machine Learning Foundation (C) 2020 IBM Corporation